; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-4-4-171)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p3-0 - location
	p3-4 - location
	p5-3 - location
	p6-0 - location
	p6-5 - location
	p4-0 - location
	p4-5 - location
	p4-6 - location
	p1-0 - location
	p1-3 - location
	p2-0 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s1)
	(at driver3 s3)
	(at driver4 s3)
	(at driver5 s3)
	(at truck1 s6)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s2)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s0)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s4)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at package1 s2)
	(at package2 s0)
	(at package3 s4)
	(at package4 s1)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(= (time-to-walk s3 p3-0) 10)
	(= (time-to-walk p3-0 s3) 10)
	(= (time-to-walk s0 p3-0) 13)
	(= (time-to-walk p3-0 s0) 13)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(= (time-to-walk s3 p3-4) 12)
	(= (time-to-walk p3-4 s3) 12)
	(= (time-to-walk s4 p3-4) 1)
	(= (time-to-walk p3-4 s4) 1)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(= (time-to-walk s5 p5-3) 3)
	(= (time-to-walk p5-3 s5) 3)
	(= (time-to-walk s3 p5-3) 6)
	(= (time-to-walk p5-3 s3) 6)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(= (time-to-walk s6 p6-0) 7)
	(= (time-to-walk p6-0 s6) 7)
	(= (time-to-walk s0 p6-0) 1)
	(= (time-to-walk p6-0 s0) 1)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(= (time-to-walk s6 p6-5) 13)
	(= (time-to-walk p6-5 s6) 13)
	(= (time-to-walk s5 p6-5) 6)
	(= (time-to-walk p6-5 s5) 6)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 3)
	(= (time-to-walk p4-0 s4) 3)
	(= (time-to-walk s0 p4-0) 3)
	(= (time-to-walk p4-0 s0) 3)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(= (time-to-walk s4 p4-5) 13)
	(= (time-to-walk p4-5 s4) 13)
	(= (time-to-walk s5 p4-5) 15)
	(= (time-to-walk p4-5 s5) 15)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(= (time-to-walk s4 p4-6) 14)
	(= (time-to-walk p4-6 s4) 14)
	(= (time-to-walk s6 p4-6) 8)
	(= (time-to-walk p4-6 s6) 8)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 6)
	(= (time-to-walk p1-0 s1) 6)
	(= (time-to-walk s0 p1-0) 1)
	(= (time-to-walk p1-0 s0) 1)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(= (time-to-walk s1 p1-3) 15)
	(= (time-to-walk p1-3 s1) 15)
	(= (time-to-walk s3 p1-3) 8)
	(= (time-to-walk p1-3 s3) 8)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 2)
	(= (time-to-walk p2-0 s2) 2)
	(= (time-to-walk s0 p2-0) 1)
	(= (time-to-walk p2-0 s0) 1)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 5)
	(= (time-to-drive s1 s6) 5)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 13)
	(= (time-to-drive s2 s6) 13)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 1)
	(= (time-to-drive s0 s4) 1)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 15)
	(= (time-to-drive s6 s4) 15)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 8)
	(= (time-to-drive s0 s1) 8)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 14)
	(= (time-to-drive s3 s1) 14)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 9)
	(= (time-to-drive s0 s2) 9)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 12)
	(= (time-to-drive s1 s2) 12)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 3)
	(= (time-to-drive s3 s0) 3)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 12)
	(= (time-to-drive s6 s0) 12)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 15)
	(= (time-to-drive s2 s5) 15)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 8)
	(= (time-to-drive s3 s5) 8)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 13)
	(= (time-to-drive s4 s5) 13)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 1)
	(= (time-to-drive s2 s3) 1)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 13)
	(= (time-to-drive s4 s3) 13)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 6)
	(= (time-to-drive s6 s3) 6)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s5)
	(at truck2 s0)
	(at truck3 s2)
	(at truck4 s1)
	(at package1 s6)
	(at package2 s4)
	(at package4 s6)
	))

(:metric minimize (+ (* 1 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (board-truck driver1 truck3 s0)
   deleted: (at driver1 s0) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 0 of 7
2. (load-truck package2 truck3 s0)
   deleted: (at package2 s0)
   added: (in package2 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 0 of 7
3. (drive-truck truck3 s0 s6 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s6)
   changed: (fuel-used) from 0 to 132
   goals met: 0 of 7
4. (walk driver5 s3 p3-4)
   deleted: (at driver5 s3)
   added: (at driver5 p3-4)
   goals met: 0 of 7
5. (walk driver5 p3-4 s4)
   deleted: (at driver5 p3-4)
   added: (at driver5 s4)
   goals met: 0 of 7
6. (board-truck driver5 truck4 s4)
   deleted: (at driver5 s4) (empty truck4)
   added: (driving driver5 truck4)
   goals met: 0 of 7
7. (drive-truck truck3 s6 s2 driver1)
   deleted: (at truck3 s6)
   added: (at truck3 s2)
   changed: (fuel-used) from 132 to 275
   goals met: 1 of 7
8. (drive-truck truck4 s4 s6 driver5)
   deleted: (at truck4 s4)
   added: (at truck4 s6)
   changed: (fuel-used) from 275 to 425
   goals met: 1 of 7
9. (drive-truck truck4 s6 s1 driver5)
   deleted: (at truck4 s6)
   added: (at truck4 s1)
   changed: (fuel-used) from 425 to 475
   goals met: 2 of 7
10. (load-truck package4 truck4 s1)
   deleted: (at package4 s1)
   added: (in package4 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 2 of 7
11. (load-truck package1 truck3 s2)
   deleted: (at package1 s2)
   added: (in package1 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 2 of 7
12. (drive-truck truck3 s2 s6 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s6)
   changed: (fuel-used) from 475 to 644
   goals met: 1 of 7
13. (unload-truck package1 truck3 s6)
   deleted: (in package1 truck3)
   added: (at package1 s6)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 2 of 7
14. (drive-truck truck3 s6 s4 driver1)
   deleted: (at truck3 s6)
   added: (at truck3 s4)
   changed: (fuel-used) from 644 to 809
   goals met: 2 of 7
15. (unload-truck package2 truck3 s4)
   deleted: (in package2 truck3)
   added: (at package2 s4)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 3 of 7
16. (drive-truck truck3 s4 s5 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   changed: (fuel-used) from 809 to 939
   goals met: 3 of 7
17. (drive-truck truck4 s1 s6 driver5)
   deleted: (at truck4 s1)
   added: (at truck4 s6)
   changed: (fuel-used) from 939 to 994
   goals met: 2 of 7
18. (unload-truck package4 truck4 s6)
   deleted: (in package4 truck4)
   added: (at package4 s6)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 3 of 7
19. (drive-truck truck4 s6 s2 driver5)
   deleted: (at truck4 s6)
   added: (at truck4 s2)
   changed: (fuel-used) from 994 to 1124
   goals met: 3 of 7
20. (disembark-truck driver5 truck4 s2)
   deleted: (driving driver5 truck4)
   added: (at driver5 s2) (empty truck4)
   goals met: 3 of 7
21. (drive-truck truck3 s5 s2 driver1)
   deleted: (at truck3 s5)
   added: (at truck3 s2)
   changed: (fuel-used) from 1124 to 1274
   goals met: 4 of 7
22. (board-truck driver5 truck2 s2)
   deleted: (at driver5 s2) (empty truck2)
   added: (driving driver5 truck2)
   goals met: 4 of 7
23. (disembark-truck driver1 truck3 s2)
   deleted: (driving driver1 truck3)
   added: (at driver1 s2) (empty truck3)
   goals met: 4 of 7
24. (board-truck driver1 truck4 s2)
   deleted: (at driver1 s2) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 4 of 7
25. (drive-truck truck4 s2 s1 driver1)
   deleted: (at truck4 s2)
   added: (at truck4 s1)
   changed: (fuel-used) from 1274 to 1394
   goals met: 5 of 7
26. (disembark-truck driver1 truck4 s1)
   deleted: (driving driver1 truck4)
   added: (at driver1 s1) (empty truck4)
   goals met: 5 of 7
27. (drive-truck truck2 s2 s0 driver5)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   changed: (fuel-used) from 1394 to 1484
   goals met: 6 of 7
28. (drive-truck truck2 s0 s4 driver5)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   changed: (fuel-used) from 1484 to 1494
   goals met: 5 of 7
29. (walk driver1 s1 p1-3)
   deleted: (at driver1 s1)
   added: (at driver1 p1-3)
   goals met: 5 of 7
30. (drive-truck truck2 s4 s0 driver5)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   changed: (fuel-used) from 1494 to 1504
   goals met: 6 of 7
31. (walk driver1 p1-3 s3)
   deleted: (at driver1 p1-3)
   added: (at driver1 s3)
   goals met: 6 of 7
32. (walk driver1 s3 p5-3)
   deleted: (at driver1 s3)
   added: (at driver1 p5-3)
   goals met: 6 of 7
33. (walk driver1 p5-3 s5)
   deleted: (at driver1 p5-3)
   added: (at driver1 s5)
   goals met: 7 of 7
